export default function InformationMainProject({ param }) {
  
  const projects = {
    1: {
      name: "مشاور املاک  ",
      description: "در طراحی این دفتر مشاوره املاک، تمرکز بر ایجاد فضایی رسمی، روشن و قابل اعتماد بوده است. استفاده از رنگ‌های خنثی، چیدمان منظم و متریال مدرن باعث القای حس شفافیت و حرفه‌ای بودن می‌شود. این فضا به گونه‌ای طراحی شده که هم محیطی کاری و رسمی داشته باشد و هم حس دعوت‌کنندگی برای مراجعه‌کنندگان ایجاد کند.",
      features: [
        "طراحی روشن و منظم با متریال مدرن   ",
        "تاکید بر حس اعتماد و شفافیت  ",
        "ترکیب عملکردگرایی با زیبایی بصری ",
        
      ]
    },
    2: {
      name: "سالن زیبایی  ",
      description: "طراحی این فضا با هدف تلفیق ظرافت زنانه و حس مدرنیته انجام شد. استفاده از خطوط مینیمال، رنگ‌های روشن و المان‌های سبز طبیعی باعث شده محیطی آرام، دلنشین و لوکس شکل بگیرد. تقسیم‌بندی هوشمندانه‌ی فضا، تجربه‌ی خصوصی و راحتی را برای هر مراجعه‌کننده ممکن کرده است.",
      features: [
        " طراحی مینیمال با جزئیات لوکس ",
        "استفاده  از رنگ های روشن و خطوط نرم",
        "حضور گیاهان برای ایجاد حس طراوت و آرامش",
        
      ]
    },
    3: {
      name: "دفتر کار   ",
      description: "در این پروژه هدف ایجاد تصویری رسمی و مدرن از یک دفتر مدیریتی بود. ترکیب متریال چوب، سنگ و نور مخفی، جلوه‌ای هم‌زمان گرم و حرفه‌ای ایجاد کرده است. در طراحی داخلی، توجه به مسیرهای حرکتی و سلسله‌مراتب فضایی، باعث شد فضا هم کاربردی باشد و هم با هویت برند مجموعه هماهنگ شود.",
      features: [
       "هماهنگی طراحی نما و فضای داخلی",
        "ترکیب متریال طبیعی وصنعتی",
        "هویت بصری منطبق با برند",
        
      ]
    },
    4: {
      name: "رستوران جانا  ",
      description:"این پروژه با هدف خلق فضایی پویا و چندمنظوره برای پذیرایی و استراحت در یک مجتمع چندطبقه طراحی شد. طراحی داخلی بر پایه ترکیب بافت‌های طبیعی، رنگ‌های آرامش‌بخش و نورپردازی کاربردی شکل گرفت تا محیطی دلپذیر برای مشتریان فراهم شود. جزئیات سبز و استفاده از گیاهان زینتی باعث ایجاد حس طراوت و تداوم در فضا شده‌اند.",
      features: [
        "طراحی چند منظوره برای کاربری های متنوع ",
        "استفاده  از بافت و رنگ های طبیعی",
        "حضور المان های سبز در فضا",
       
      ]
    },
    5: {
      name: "کافه کاملیا",
      description: "در این پروژه تمرکز بر به‌روزرسانی چیدمان و المان‌های دکوراتیو کافه بود، در حالی‌که ساختار اصلی فضا حفظ شد. هدف، ایجاد حس گرما و صمیمیت در محیطی محدود بود تا کاربران تجربه‌ای راحت‌تر و منسجم‌تر از فضا داشته باشند. استفاده از ترکیب متریال‌های چوب، فلز و نورپردازی ملایم، هویت تازه‌ای به فضا بخشیده است.",
      features: [
       "باز طراحی بر اساس پلان موجود ",
        "ترکیب متریال گرم و مدرن   ",
        "بهینه سازی مسیر حرکت و نشیمن ها  ",
        
      ] 
    },
    6: {
      name: "منزل آقابزرگی  ",
      description: "فضای داخلی این پروژه بر پایه مینیمالیسم و لوکس‌بودن طراحی شده است. استفاده از رنگ‌های خنثی، سطوح صاف و متریال‌های باکیفیت مانند سنگ مرمر و چوب طبیعی، حس آرامش، نظم و مدرنیته را در فضا ایجاد کرده است.",
      features: [
        "طراحی مینیمال با جزئیات دقیق و ساده",
        "ترکیب متریال های لوکس و رنگ های خنثی",
        "نورپردازی نرم برای تاکید بر فرم و بافت فضا",
        
      ]
    },
    7: {
      name: " ویلای کیاشهر ",
      description:"این پروژه با تلفیق ظرافت معماری نئوکلاسیک و سادگی فرم‌های مدرن طراحی شده است. تناسب ستون‌ها، جزئیات سنگ‌کاری و تقارن نما حس شکوه و اصالت را القا می‌کند، در حالی‌که نورپردازی و رنگ‌بندی آن فضایی گرم و صمیمی پدید می‌آورد.",
      features: [
        "تلفیق سبک نئو کلاسیک با جزئیات مدرن",
        "استفاده از سنگ کرم روشن و نورپردازی نرم",
        "طراحی تقارن محور با ورودی شاخص"
      ]
    },
    8: {
      name: "ویلای خرارود ",
      description: "این ویلا با الهام از طبیعت و ترکیب مصالح گرم چوب با متریال سنگ طراحی شده است. فضاهای داخلی و بیرونی در امتداد یکدیگر شکل گرفته‌اند تا حس زندگی در دل طبیعت را به ساکنین منتقل کنند.",
      features: [
        "ترکیب هماهنگ چوب طبیعی و سنگ روشن  ",
        "طراحی باز و یگپارچه بین فضا های داخلی و حیاط ",
        " استفاده از نور طبیعی و قاب بندی مناظر اطراف",
        
      ]
    },
    9: {
      name: "ساختمان جانا ",
      description:"طراحی این نمای مدرن با تمرکز بر تناسبات حجمی، استفاده از خطوط مشکی شاخص و ترکیب سنگ و متریال‌های تیره انجام شده است. هدف، خلق چهره‌ای لوکس و معاصر برای یک ساختمان چند‌واحدی شهری تجاری بوده است که در عین سادگی، جلوه‌ای قدرتمند و به‌روز دارد.",
      features: [
        "طراحی مدرن با متریال سنگ و خطوط مشکی   ",
        "کاهش عمق نما برای بهینه سازی هزینه ساخت   ",
        "نورپردازی ظریف برای تاکید بر شکست های حجمی  ",
        
      ]
    },
    10: {
      name: " پنت هاوس هدایت",
      description: "این پروژه با هدف ترکیب لوکس‌بودن و راحتی طراحی شده است. طراحی داخلی پنت‌هاوس بر اساس متریال‌های باکیفیت و رنگ‌بندی گرم انجام شده و روف‌گاردن آن، ادامه‌ی همین سبک در فضای باز است. ترکیب متریال‌های مدرن با خطوط نرم، حس تداوم و هماهنگی را در کل فضا ایجاد کرده است.",
      features: [
        "  طراحی یکپارچه بین فضای داخلی و بیرونی",
        "استفاده از متریال های لوکس و جزئیات دقیق اجرایی    ",
        "نورپردازی هوشمند و ایجاد حس پیوستگی فضایی  ",
        
      ]
    },
    11: {
      name: "سکوت سبز  ",
      description: "روف‌گاردن با الهام از سبک زندگی مدرن و نیاز به فضاهای باز شهری طراحی شده است. در این پروژه تلاش شده با ترکیب فضای سبز، نشیمن‌های متنوع و المان‌های دکوراتیو مانند آتشدان، محیطی آرام و دعوت‌کننده شکل گیرد. طراحی نور و متریال‌ها نیز هماهنگی کامل با فضای بیرونی دارند.",
      features: [
        "طراحی چند منظوره با فضاهای نشیمن و استراحت  ",
        "استفاده از متریال مقاوم در برابر شرایط محیطی  ",
        "تلفیق فضای سبز، نورپردازی و المان های دکوراتیو ",
        
      ]
    },
    12: {
      name: "ساختمان پرنیان ",
      description: "طراحی این ویلا با الهام از طبیعت اطراف و ترکیب متریال‌های طبیعی مانند چوب و سنگ انجام شده است. هدف، ایجاد نمایی مدرن و هماهنگ با محیط جنگلی بوده که در عین سادگی، حس گرما و پویایی را منتقل کند. نورپردازی نما و حجم‌های باز و بسته، ارتباط درون و بیرون را به شکلی نرم برقرار کرده‌اند",
      features: [
        "ترکیب چوب و سنگ با خطوط مدرن و ساده   ",
        "  طراحی هماهنگ با محیط طبیعی و مناظر اطراف ",
        "نورپردازی نما برای تاکید بر حجم ها و بافت ها ",
        
      ]
    },
    13: {
      name: "خانه ای در میان درختان  ",
      description: "طراحی این ویلا با الهام از طبیعت اطراف و ترکیب متریال‌های طبیعی مانند چوب و سنگ انجام شده است. هدف، ایجاد نمایی مدرن و هماهنگ با محیط جنگلی بوده که در عین سادگی، حس گرما و پویایی را منتقل کند. نورپردازی نما و حجم‌های باز و بسته، ارتباط درون و بیرون را به شکلی نرم برقرار کرده‌اند.",
      features: [
        "ترکیب چوب و سنگ با خطوط مدرن و ساده   ",
        "طراحی هماهنگ با محیط طبیعی و مناظر اطراف  ",
        "نورپردازی نما برای برای تاکید بر حجم ها و بافت ها ",
        
      ]
    },
    14: {
      name: "ویلای سیاهکل ",
      description: "در این پروژه تمرکز بر خلق فضایی گرم و مدرن بوده که ترکیب بافت‌های طبیعی و متریال‌های تیره، حس آرامش و لوکسی را هم‌زمان منتقل کند. طراحی نورپردازی و جزئیات سقف، به تقویت عمق فضا و هماهنگی میان بخش‌های نشیمن و آشپزخانه کمک کرده است.",
      features: [
        "ترکیب رنگ های خنثی با متریال چوب  و سنگ طبیعی ",
        "طراحی نورپردازی چند لایه برای ایجاد عمق و گرما  ",
        "یکپارچگی فضایی بین نشیمن، پذیرایی و آشپزخانه  ",
        
      ]
    },
    15: {
      name: "آپارتمان هدایت ",
      description: "در این پروژه تمرکز بر ترکیب متریال چوب و رنگ مشکی بوده تا فضایی مدرن، شیک و در عین حال گرم ایجاد شود. تضاد بین سطوح تیره و بافت طبیعی چوب، به فضا عمق و شخصیت داده است. نورپردازی ملایم و خطوط ساده طراحی، باعث شده فضا در عین سادگی، حس لوکس و صمیمی خود را حفظ کند.",
      features: [
        "ترکیب چوب طبیعی با کابینت های مشکی مات  ",
        "طراحی نورپردازی متمرکز برای ایجاد کنتراست و عمق    ",
        "حفظ تعادل بین سادگی، گرما و جلوه مدرن فضا  ",
        
      ]
    },
    16: {
      name: "ویلای 3000  ",
      description: "در این پروژه تمرکز بر خلق فضایی گرم و مدرن بوده که ترکیب بافت‌های طبیعی و متریال‌های تیره، حس آرامش و لوکسی را هم‌زمان منتقل کند. طراحی نورپردازی و جزئیات سقف، به تقویت عمق فضا و هماهنگی میان بخش‌های نشیمن و آشپزخانه کمک کرده است.",
      features: [
        "ترکیب رنگ های خنثی با متریال چوب و سنگ طبیعی  ",
        "طراحی نورپردازی چند لایه برای ایجاد عمق و گرما    ",
        "یکپارچگی فضایی بین نشیمن، پذیرایی و آشپزخانه  ",
        
      ]
    },
    17: {
      name: "ویلای سیاهکل-داخلی ",
      description: "در این پروژه تمرکز بر خلق فضایی گرم و مدرن بوده که ترکیب بافت‌های طبیعی و متریال‌های تیره، حس آرامش و لوکسی را هم‌زمان منتقل کند. طراحی نورپردازی و جزئیات سقف، به تقویت عمق فضا و هماهنگی میان بخش‌های نشیمن و آشپزخانه کمک کرده است.",
      features: [
        "ترکیب رنگ های خنثی با متریال چوب و سنگ طبیعی ",
        "طراحی نورپردازی چند لایه برای ایجاد عمق و گرما  ",
        "یکپارچگی فضایی بین نشیمن ،پذیرایی و آشپزخانه  ",
       
      ]
    }
  }

  const project = projects[param]

  if (!project) {
    return <p className="text-red-500">پروژه‌ای با این شناسه پیدا نشد.</p>
  }

  return (
    <>
      {/* بخش اصلی */}
      <div className="md:col-span-2">
        <h1 className="text-3xl font-bold mb-4 text-white">{project.name}</h1>
        <div className="prose prose-invert">
          <p className="text-gray-300 mb-4">
            {project.description}
          </p>
          <h3 className="text-xl font-semibold mb-3 text-white">ویژگی‌های کلیدی</h3>
          <ul className="list-disc pl-5 space-y-2 mb-6 text-gray-300">
            {project.features.map((feature, index) => (
              <li key={index}>{feature}</li>
            ))}
          </ul>
        </div>
      </div>
    </>
  )
} 